       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLCOPYD.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-ISERIES WITH DEBUGGING MODE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      DCOPY QUSEC OF QSYSINC-QCBLLESRC.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY BYTES-PROVIDED OF QUS-EC.
           STOP RUN.
