       IDENTIFICATION DIVISION.

       PROGRAM-ID. COBOLDEBUG.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 W01-COUNT PIC 9(02).

       PROCEDURE DIVISION.
       MAIN.

           PERFORM VARYING W01-COUNT FROM 1 BY 1 UNTIL W01-COUNT > 9
               DISPLAY "Linea " W01-COUNT
           END-PERFORM.

           STOP RUN.
