       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLONSZ.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 W01-TOTALAMOUNT PIC 9(63) VALUE 0.

       PROCEDURE DIVISION.
       MAIN.
           ADD 500000 400000 300000 TO W01-TOTALAMOUNT
           ON SIZE ERROR PERFORM CALC-ERROR.
           DISPLAY W01-TOTALAMOUNT.
           STOP RUN.
