       PROCESS NOMONOPRC.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLRNDS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
         SOURCE-COMPUTER. IBM-ISERIES.
         OBJECT-COMPUTER. IBM-ISERIES.
         SPECIAL-NAMES.
         LINKAGE TYPE PROCEDURE FOR "Qc3GenPRNs".

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       COPY QC3CCI OF QSYSINC-QCBLLESRC.
       COPY QUSEC OF QSYSINC-QCBLLESRC.
       01 WS-RAND-BYTES PIC X(32).

       PROCEDURE DIVISION.
       MAIN.
           CALL "Qc3GenPRNs" USING
               BY REFERENCE WS-RAND-BYTES,
               BY CONTENT   LENGTH OF WS-RAND-BYTES,
               BY CONTENT   "0",
               BY CONTENT   "0",
               BY REFERENCE QUS-EC.
           DISPLAY "Random: " WS-RAND-BYTES.

           STOP RUN.
