       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLOF.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 W01-FIRSTNAME PIC X(10) VALUE "FLUID".
       01 W02-LASTNAME  PIC X(10) VALUE "SIGNAL".
       01 W03-FULLNAME  PIC X(10).

       PROCEDURE DIVISION.
       MAIN.
           STRING W01-FIRSTNAME SPACE W02-LASTNAME
           DELIMITED BY SPACE
           INTO W03-FULLNAME
           DISPLAY "Nombre completo: ", W03-FULLNAME.
           STOP RUN.
