Repository: jeanbaptistemora/fluidattacks-universe2
Catalog: theme/2014/translations/*/LC_MESSAGES/messages.po
Languages: es

# Archives-metadescription
source: Here you can find the latest articles posted to the blog, which are related to the field of Information Security. These articles may aim to share an opinion about a security matter, to solve a challenge related to this very subject or may just offer general information
es: Aquí puedes encontrar los artículos más recientes publicados en el blog, los cuales están relacionados con el campo de Seguridad de Información. Estos artículos pueden buscar compartir una opinión acerca de un tema de seguridad, resolver un reto relacionado a este mismo tema, o simplemente ofrecer ínformación general

# Archives-keywords
source: Information, Security, Archives, Latest, Articles, Blog
es: Información, Seguridad, Archivos, Recientes, Artículos, Blog

# Archives-title
source: Blog Archives
es: Archivos del Blog

# Arcives-msg-1
source: Archives for
es: Archivos para

# Breadcrumb-0
source: Home
es: Inicio

# Articles-breadcrumb-1
source: Categories
es: Categorías

# Articles-icon-alt-1
source: User icon
es: Ícono de usuario

# Articles-icon-alt-2
source: Dialog box icon
es: Ícono de globo de diálogo

# Articles-icon-msg-1
source: Comment
es: Comentar

# Articles-icon-alt-3
source: Folder icon
es: Ícono de carpeta

# Articles-icon-alt-4
source: Calendar icon
es: Ícono de calendario

# Articles-author-alt
source: Author picture
es: Foto del autor

# Articles-related-sect
source: Related
es: Relacionado

# Author-metadescription-1
source: Here you can find all the articles written by the author
es: Acá puedes encontrar todos los artículos escritos por el autor

# Author-metadescription-2
source: The articles are ordered by publishing date, starting with the last one. They offer information about the different topics in the field of Information Security.
es: Los artículos se encuentran ordenados por fecha de publicación. Ofrecen información acerca de diferentes temas en el campo de la Seguridad de la Información.

# Author-keywords
source: Author, Article, Information, Security, Blog, Publising, Date
es: Autor, Artículo, Información, Seguridad, Blog, Publicación, Fecha

# Authors-metadescription
source: Here you can find the list of all the authors that have contributed to the blog by publishing an article which may have an opinion, a solution to a challenge, or just general information related to many topics in the field of Information Security
es: Aquí puedes encontrar una lista de todos los autores que han contribuido al blog publicando algún artículo, que puede contener una opinión, una solución a un reto, o simplemente información general relacionada a diversos temas en el campo de la Seguridad de la Información

# Authors-keywords
source: Authors, Blog, Publish, Article, Information, Security
es: Autores, Blog, Publicar, Artículo, Información, Seguridad

# Authors-title
source: Authors
es: Autores

# Authors-breadcrumb-1
source: Authors
es: Autores

# Selected-img-alt
source: Selected field icon
es: Ícono de campo seleccionado

source: Translate-msg-es
es: Disponible en

# Authors-header
source: Authors
es: Autores

# Header-img-alt
source: Young hacker smiling
es: Joven hacker sonriendo

# Header-title-1
source: We hack your software
es: Hackeamos su software

# Header-title-2
source: Zero false positives
es: cero falsos positivos

# Header-msg
source: Expert intelligence + effective automation
es: <strong>Inteligencia experta + automatización eficaz</strong>

# Header-item-1
source: Comprehensive security testing at DevOps speed
es: Ataques exhaustivos a velocidad DevOps

# Header-item-3
source: Attacking Web, APIs, mobile apps, Servers, Networks, IoT Devices
es: Atacando Web, APIs, Apps móviles, Servidores, Redes, Dispositivos IoT

# Categories-metadescription
source: Here you can find the list of categories used to classify the articles of the blog. They are all related to the field of Information Security and may range from an opinion related to a certain topic, or a solution to a challenge, all the way to just general information
es: Aquí puedes encontrar una lista de las categorías utilizadas para clasificar los artículos del blog. Todos los artículos se relacionan con el campo de la Seguridad de la Información y pueden tratar desde una opinión sobre un tema específico, o una solución a un reto, hasta información general

# Categories-keywords
source: Category, Classify, Articles, Blog, Information, Security
es: Categoría, Clasificar, Artículo, Blog, Información, Seguridad

# Categories-title
source: Categories
es: Categorías

# Categories-breadcrumb-1
source: Categories
es: Categorías

# Categories-header
source: Categories
es: Categorías

# Category-metadescription-1
source: Here you can find all the articles of the blog which are related to the category
es: Aquí puedes encontrar todos los artículos del blog que se relacionan con la categoría

# Category-metadescription-2
source: The articles are ordered according to their publishing date and may address different subjets related to the field of Information Security
es: Los artículos se encuentran ordenados de acuerdo a su fecha de publicación y pueden tratar diferentes temas relacionados con el campo de la Seguridad de la Información

# Category-keywords
source: Article, Category, Blog, Information, Security, Date
es: Artículo, Categoría, Blog, Información, Seguridad, Fecha

# Category-breadcrumb-1
source: Categories
es: Categorías

# Comment-msg-1
source: There are
es: Tiene

# Comment-msg-2
source: comments
es: comentarios

# Error-metadescription
source: An error occured. The page you requested does not exist or is not available at the moment. Here you can find links to most of the relevant content of the website
es: Ha ocurrido un error. La página que buscaste no existe o no se encuentra disponible en el momento. Aquí puedes encontrar enlaces al contenido más relevante del sitio web

# Error-keywords
source: Error, Request, Page, Availability, Links, Content
es: Error, Petición, Página, Disponibilidad, Enlace, Contenido

# Error-title
source: The page was not found
es: La página no ha sido encontrada

# Error-header-1
source: PAGE NOT FOUND
es: PÁGINA NO ENCONTRADA

# Error-msg-1
source: It seems nothing was found in this address. Try searching or browsing to one of the following links
es: Parece que no hay nada indexado en esta dirección. Intenta una búsqueda o haz click en uno de los siguientes links

# Error-header-2
source: Services
es: Servicio

# Error-cat-1
source: services
es: servicios

# Error-header-3
source: Products
es: Productos

# Error-cat-2
source: products
es: producto

# Error-header-4
source: Recent Blog Entries
es: Entradas Recientes del Blog

# Error-header-5
source: Blog Categories
es: Categorías del Blog

# Error-header-6
source: Careers
es: Empleos

# Error-cat-3
source: careers
es: empleos

# Footer-logo-1
source: Fluid Attacks logo
es: Logo de Fluid Attacks

# Footer-logo-2
source: Twitter logo
es: Logo de Twitter

# Footer-logo-3
source: Facebook logo
es: Logo de Facebook

# Footer-logo-5
source: LinkedIn logo
es: Logo de LinkedIn

# Footer-logo-6
source: YouTube logo
es: Logo de YouTube

# Footer-header-1
source: About Us
es: Nosotros

# Footer-link-1.1
source: values
es: valores

# Footer-subtitle-1.1
source: Values
es: Valores

# Footer-link-1.2
source: events
es: eventos

# Footer-subtitle-1.2
source: Events
es: Eventos

# Footer-link-1.3
source: people
es: personas

# Footer-subtitle-1.3
source: People
es: Personas

# Footer-link-1.4
source: partners
es: aliados

# Footer-subtitle-1.4
source: Partners
es: Aliados

# Footer-link-1.5
source: location
es: ubicacion

# Footer-subtitle-1.5
source: Location
es: Ubicación

# Footer-link-1.6
source: contact-us
es: contactanos

# Footer-subtitle-1.6
source: Contact Us
es: Contáctanos

# Footer-cat-1
source: services
es: servicios

# Footer-header-2
source: Services
es: Servicios

# Footer-link-2.1
source: one-shot-hacking
es: hacking-puntual

# Footer-subtitle-2.1
source: One-Shot Hacking
es: Hacking Puntual

# Footer-link-2.2
source: continuous-hacking
es: hacking-continuo

# Footer-subtitle-2.2
source: Continuous Hacking
es: Hacking Continuo

# Footer-link-2.3
source: differentiators
es: diferenciadores

# Footer-subtitle-2.3
source: Differentiators
es: Diferenciadores

# Footer-link-2.4
source: comparative
es: comparativo

# Footer-subtitle-2.4
source: Comparative
es: Comparativo

# Footer-link-2.5
source: certifications
es: certificaciones

# Footer-subtitle-2.5
source: Certifications
es: Certificaciones

# Footer-cat-1.1
source: blog/categories
es: blog/categorias

# Footer-link-2.6
source: attacks
es: ataques

# Footer-subtitle-2.6
source: Attacks
es: Ataques

# Footer-cat-2
source: products
es: productos

# Footer-header-3
source: Products
es: Productos

# Footer-link-4.8
source: reviews
es: testimonios

# Footer-subtitle-4.8
source: Reviews
es: Testimonios

# Footer-subtitle-5.1
source: Subscribe
es: Suscríbete

# Footer-link-5.2
source: categories
es: categorias

# Footer-subtitle-5.2
source: Categories
es: Categorías

# Footer-link-5.3
source: tags
es: etiquetas

# Footer-subtitle-5.3
source: Tags
es: Etiquetas

# Footer-link-5.4
source: authors
es: autores

# Footer-subtitle-5.4
source: Authors
es: Autores

# Footer-link-5.5
source: topics
es: temas

# Footer-subtitle-5.5
source: Topics
es: Temas

# Footer-link-5.6
source: style
es: estilo

# Footer-subtitle-5.6
source: Style
es: Estilo

# Footer-subtitle-5.7
source: Format
es: Formato

# Footer-cat-4
source: careers
es: empleos

# Footer-header-6
source: Careers
es: Empleos

# Footer-link-6.1
source: reasons
es: razones

# Footer-subtitle-6.1
source: Reasons
es: Razones

# Footer-link-6.2
source: openings
es: vacantes

# Footer-subtitle-6.2
source: Openings
es: Vacantes

# Footer-link-6.3
source: terms
es: terminos

# Footer-subtitle-6.3
source: Terms
es: Términos

# Footer-link-6.4
source: knowledge-test
es: evaluacion-conocimientos

# Footer-subtitle-6.4
source: Knowledge Test
es: Conocimientos

# Footer-link-6.5
source: technical-challenges
es: retos-tecnicos

# Footer-subtitle-6.5
source: Challenges
es: Retos

# Footer-link-6.6
source: immersion
es: inmersion

# Footer-subtitle-6.6
source: Immersion
es: Inmersión

# Footer-stat-msg-1
source: Service status
es: Estado de los servicios

# Footer-status-link-1
source: terms-use
es: terminos-uso

# Footer-stat-msg-2
source: Terms of Use
es: Términos de Uso

# Form-field-1
source: Full Name
es: Nombres

# Form-field-2
source: Email
es: Apellidos

# Form-field-3
source: Mobile
es: Correo Electrónico

# Form-field-4
source: How can we help you?
es: Compañía

# Form-field-5
source: I want a service proposal
es: Ciudad

# Form-field-6
source: I am looking for a job
es: Estado/Provincia

# Index-metadescription
source: Here you can find all the articles published to the blog, which may address an opinion, a solution to a challenge, or just general information, all related to the field of Information Security.
es: Aquí puedes encontrar todos los artículos publicados en el blog, que opueden tratar una opinión, una solución a un reto, o simplemente información general, todo relacionado con el campo de Seguridad de la Información

# Index-keywords
source: Articles, Blog, Opinion, Challenge, Information, Security
es: Artículos, Blog, Opinión, Reto, Información, Seguridad

# Index-icon-alt-1
source: Quill icon
es: Ícono de pluma

# Index-icon-alt-2
source: Folder icon
es: Ícono de carpeta

# Index-icon-alt-3
source: Tag icon
es: Ícono de etiqueta

# Index-msg-btn
source: Read More
es: Seguir Leyendo

# Landing-metadescription
source: We are a company specialized in Ethical Hacking over Applications and Infrastructure. We are hackers who develop our own tools and exploits, with the aim of identifying all the vulnerabilities of your applications and report them as soon as possible
es: Somos una compañía especialista en Ethical Hacking de Aplicación e Infraestructura. Somos hackers que desarrollamos nuestras propias herramientas y exploits, cuyo objetivo identificar todas las vulnerabilidades de sus aplicaciones y reportarlas lo más pronto posible.

# Landing-keywords
source: Fluid Attacks, Ethical Hacking, Vulnerability, Diagnosis, Application, Infrastructure
es: Fluid Attacks, Ethical hacking, Vulnerabilidad, Diagnóstico, Aplicación, Infraestructura

# Landing-title
source: Home
es: Inicio

# Index-header-0
source: Purpose
es: Propósito

# Index-msg-0
source: Find all vulnerabilities and report them as soon as possible.
es: Encontrar todas las vulnerabilidades y reportarlas lo antes posible.

# Purpose-img-alt-1
source: Target scope
es: Mira

# Purpose-img-alt-2
source: Lock
es: Candado

# Purpose-img-alt-3
source: Notepad and arrows
es: Libreta y flechas

# Purpose-msg-1
source: Find
es: Encontrar

# Purpose-msg-2
source: Attack
es: Atacar

# Purpose-msg-3
source: Report
es: Reportar

# Index-header-1
source: Services
es: Servicios

# Index-msg-1
source: What we do is attack your software in a comprehensive way at high speed. We do Static Security Testing (SAST), Dynamic Security Testing (DAST), Interactive Security Testing (IAST) and Software Composition Analysis (SCA) automating the confirmed vulnerabilities in any stage of the development lifecycle (SDLC).
es: Atacamos su software de forma integral a alta velocidad. Realizamos Pruebas de Seguridad Estáticas (SAST), Pruebas de Seguridad Dinámicas (DAST), Pruebas de seguridad Interactivas (IAST) y Análisis de Composición de Software (SCA), automatizando las vulnerabilidades confirmadas, en cualquier etapa del ciclo de vida de desarrollo (SDLC).

# Index-img-alt
source: Service
es: Servicio

# Index-cat-1
source: services
es: servicios

# Index-serv-1
source: continuous-hacking
es: hacking-continuo

# Index-header-2
source: Continuous Hacking
es: Hacking<br/>Continuo

# Index-serv-2
source: one-shot-hacking
es: hacking-puntual

# Index-header-3
source: One-Shot Hacking
es: Hacking<br/>Puntual

# Index-serv-3
source: comparative
es: comparativo

# Index-header-3.1
source: comparative
es: comparativo.

# Serv-txt
source: If you haven't made up your mind about which service best suits your needs please visit our
es: Si aún no decide qué servicio se ajusta mejor a sus necesidades visite nuestra página

# Index-bnft-header
source: Why Fluid Attacks?
es: Por qué es <span>Fluid Attacks</span> la mejor opción para ti

# Index-img-alt-2
source: Magnifying glass analysing code
es: Lupa analizando código

# Index-bnft-1
source: <strong class="white">Tracing a vulnerability’s treatment: </strong>Forget about excel files and pdf reports! Stakeholders can manage, report and interact in Integrates, our GRC platform.
es: <strong>Máxima rigurosidad</strong> atacamos de forma integral un sistema evaluando uno a uno sus componentes.

# Index-img-alt-3
source: Closing admiration sign
es: Signo de admiración final

# Index-bnft-2
source: <strong class="white">Your security department </strong><strong class="white"> will no longer delay your project's progress: </strong>With our continuous hacking service, we report your vulnerabilities in the early stages and during the development of your project. Your developers can close vulnerabilities at the pace the project evolves.
es: <strong>Seguridad en el SDLC </strong>Incluimos buenas prácticas de seguridad desde las etapas tempranas del ciclo de vida del desarrollo.

# Index-img-alt-4
source: Graph showing the increase of earnings
es: Gráfica mostrando el incremento de ganancias

# Index-bnft-3
source: <strong class="white">Closing vulnerabilities is guaranteed: </strong>Asserts, our engine, automates attacks to verify the status (open or closed) of vulnerabilities. Asserts can be included in CI / CD environments as security gate.
es: Especializados en encontrar <strong>vulnerabilidades de día cero</strong>.

# Bnft-footmsg
source: Learn more about our
es: Conoce más arcerca de nuestros

# Contact-txt
source: Talk to our experts and start solving your vulnerabilities now!
es: Queremos que te pongas en contacto con nosotros para compartir tus comentarios, opiniones y necesidades o para recibir una asesoría completa sobre un producto o servicio de tu interés.

# Contact-img-alt
source: Letter and red arrow
es: Sobre de carta y flecha roja

# product-desc-1
source: Through <b>Integrates</b>, Fluid Attacks communicates all identified security risks to a client’s systems for prompt, efficient and effective remediation. Decision-makers know the status of their projects.
es: Plataforma de centralización y gestión de vulnerabilidades

# product-desc-2
source: <b>Asserts</b> is an automated closing engine which closes security findings over execution environments (DAST and SAST). Asserts breaks the build if finds out that the vulnerability is open, either because it reopened or has not been closed.
es: Framework de automatización de vulnerabilidades

# Navb-cat-1
source: services
es: servicios

# Navb-opt-2
source: Services
es: Servicios

# Navb-link-2.1
source: continuous-hacking
es: hacking-puntual

# Navb-opt-2.1
source: Continuous Hacking
es: Hacking Puntual

# Navb-link-2.2
source: one-shot-hacking
es: hacking-continuo

# Navb-opt-2.2
source: One Shot Hacking
es: Hacking Continuo

# Navb-cat-2
source: products
es: productos

# Navb-opt-3
source: Products
es: Productos

# Navb-link-4.1
source: financial
es: financiero

# Navb-opt-4.1
source: Financial
es: Financiero

# Navb-link-4.2
source: communications
es: comunicaciones

# Navb-opt-4.2
source: Communications
es: Comunicaciones

# Navb-link-4.3
source: consumer
es: comercial

# Navb-opt-4.3
source: Consumer
es: Comercial

# Navb-link-4.4
source: technology
es: tecnologia

# Navb-opt-4.4
source: Technology
es: Tecnología

# Navb-link-4.5
source: utilities
es: energia

# Navb-opt-4.5
source: Utilities
es: Energía

# Navb-link-4.7
source: transportation
es: transporte

# Navb-opt-4.7
source: Transportation
es: Transporte

# Navb-link-5
source: careers
es: empleos

# Navb-opt-5
source: Careers
es: Empleos

source: Navb-opt-lang-en
es: Inglés

# Navb-logo
source: Fluid Attacks logo
es: Logo de Fluid Attacks

# Navb-search-msg
source: Search this site...
es: Buscar en el sitio...

# Navb-img-alt-1
source: Magnifying glass
es: Lupa

# Pagination-prev
source: Previous
es: Anterior

# Pagination-nxt
source: Next
es: Siguiente

# Search-metadescription
source: This page shows the results of the requested search. It lists links to all the pages that contain the string searched. If the string was not found, no articles will be listed, try browsing using the menu or the footer
es: Esta página muestra los resultados de la búsqueda realizada. En ella se enlazan todas las páginas que contengan la cadena de caracteres buscada Si la cadena no fue encontrada, no se listará nada, intenta navegando a través del menú o el pie de página

# Search-keywords
source: Results, Search, Pages, String, Links, Request
es: Resultados, Buscar, Páginas, Cadena, Enlaces, Peticiones

# Search-title
source: Search
es: Búsqueda

# Search-breadcrumb-1
source: Search
es: Buscar

# Tag-metadescription-1
source: Here you can find all the articles of the blog which are related to the tag
es: Aquí puedes encontrar todos los artículos relacionados con la etiqueta

# Tag-metadescription-2
source: The articles are ordered according to their publishing date and may address different subjets related to the field of Information Security
es: Los artículos se encuentran ordenados de acuerdo a su fecha de publicación, y pueden tratar diferentes temas relacionados al campo de la Seguridad de la Información

# Tag-keywords
source: Article, Tag, Blog, Information, Security, Date
es: Artículo, Etiqueta, Blog, Información, Seguridad, Fecha

# Tag-breadcrumb-1
source: Tags
es: Etiquetas

# Tags-metadescrition
source: Here you can find the list of tags used to classify the articles of the blog. These articles are all related to the field of Information Security and may range from an opinion related to a certain topic, or a solution to a challenge, all the way to just general information
es: Aquí puedes encontrar una lista de etiquetas utilizadas para clasificar los artículos del blog. Estos artículos están relacionados con el tema de Seguridad de la Información y pueden tratar temas desde una opinión sobre un tema específico, hasta simplemente información general

# Tags-keywords
source: Tag, Classify, Articles, Blog, Information, Security
es: Etiqueta, Clasificar, Artículos, Blog, Información, Seguridad

# Tags-title
source: Tags
es: Etiquetas

# Tags-header
source: Tags
es: Etiquetas
