       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLSTR.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "Programa estricto".
           STOP RUN.
