       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLCLSF.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TEST-FILE ASSIGN TO 'TESTFILE'
           ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.
       FD TEST-FILE.
       01 TEST-FILE-RECORD PIC X(32).

       PROCEDURE DIVISION.
       MAIN.
           OPEN EXTEND TEST-FILE.
           MOVE "Hola mundo" TO TEST-FILE-RECORD.
           WRITE TEST-FILE-RECORD.
           CLOSE TEST-FILE.
           STOP RUN.
